{"@aedij.......Hoon aedij": "Meaning Not Available", "@haaput": "haaput  means bear", "@Kalkharaab": "Kalkharaab is newly invented word in Kashmir used generally by boys but girls also now started using it. It is used by young generation mostly to denote that his/her talent is â\u0080\u009cout of this worldâ\u0080\u009d , but if we see the meaning of the kal and kharaab it means that â\u0080\u009chead is faultyâ\u0080\u009d eg ye chu khalkharaab Kani Jung player means that he has top talent in Stone pelting.", "@laanat": "Meaning Not Available", "@wadun": "Meaning Not Available", "aab": "means WATER", "Aagur": "Meaning Not Available", "Aaleh": "Means Gourd -  safed  and  lyadir  were the two common types grwon in Kashmir", "Aam": "Has 2 meanings - one is Kashmiri only meaning worms in your body and the other is the Hindi word meaning common", "Aangun": "Means Garden", "Aapraavun": "To feed someone", "aata shak": "A disease prominent among males. Hey, this is what my grand-dad told me !", "aathe": "aathe means hand", "Aavlun": "मे ख्योव बत्त , पर मे छु आव्लुन इवान !    I had food, but now i feel nauseous.                    Nausea", "Aavur": "Be chush az Aavur                    Means busy", "Aay": "Means age", "Abakh Chhan": "Unskilled carpenter. Can be translated in English as round pegs in square holes", "Ach": "Means Eye", "Acharwal": "Eye lashes", "adar  zat": "unavoidable  person", "adi pagal": "halfwit : a foolish or stupid person", "Adlyok": "Adlyok means any thing that is half done", "Aeal": "Hard to spell it in English but it is cardamom. Budh Aeal is the bigger brown type used as a spice", "Aedij": "Meaning Not Available", "Agadi": "Meaning Not Available", "agadi  gachun": "not  to  let  you  go", "Agadi gachun": "Getting stuck to - not letting go - in an annoying way", "ahok": "pivot   or   fulcrum", "Aile adrakh": "When we want to express beauty of something we say \"aile adrakh\" hue                    When we want to express beauty of something we say \"aile adrakh\" hue", "akchore": "A  small  earthen  cooking   device", "Akh": "Means 1", "Amar Singh College": "An old college established in 1942 in  Gogjibagh   Srinagar", "Ander": "In - same as the Hindi word", "Andram": "Means Innards or sometimes specifically Intestines", "aneh   gagur": "small  nocternal  field   rat", "Angreez": "English language related to  Angrez  - used as \"Angeez chukh karan\" - Said to someone showing off by speaking in English", "Angrez": "English person or thing - same as the Hindi word", "Ani guet": "Meaning Not Available", "Anime": "Rice starch", "Apuz": "Lie..   Sometimes used as exclamation if someone says something not acceptable... We say \"Apuz! \"  However it's used normally in a sentence too..   Like \"Apuz ma wan\"..", "Arnimaal": "Meaning Not Available", "Arnimal": "Meaning Not Available", "arzu dhor khot": "Common blessing literally translates to \"good health and strong knee\". The knee is a literal translation but it means the ability to walk and do things.", "Asil": "Means Good (opposite of  Ganda )", "Ath": "Means Hand", "Ather": "Moth that eats woolens", "Awai": "Meaning Not Available", "Awesome": "Meaning Not Available", "Baakh": "To weep loudly, so as to let all know .", "Baand": "Baand is like a Band or more like a singer", "Baand Paethir": "A traditional folk theater ( Paethir ) performed by a  Baand", "Baanhaal": "BANIHAL", "Baazar": "Meaning Not Available", "Badan": "Meaning Not Available", "Badiyan": "Means excellent", "Bahak": "A meadow used for grazing of cattle", "Bair": "Means cat", "Bakaar": "Means Need - Bakaar chumh", "Baklad": "Means pagal", "balaay": "Balaay has multiple meanings. One meaning is literal referring to some demon. E.g. balaay ha aayi.. meaning some demon has come. Another meaning of balaay is used when someone irritates you. E.g. ye kusu balaay go agaadi", "Balai": "\"Balai\" means the ghost or the \"Jin\" in Urdu. As a reaction \"Balai\" is used as \"Mazze Balai\" which means Yummy food or thing.", "Balayi": "\"Balayan cha hyeng aasaan\"  \"Balayan cha goggle lagith aasaan\"", "Balayi lagay": "It is the transpose of Lagay Balayi but carries a different meaning - usually used to beg - please even though the individual words still mean the same", "bamb": "Bamb typically means handsome/ gorgeous. E.g bamb hue chukh gomut or bamb hish chakj gemich", "Bambaer": "Meaning Not Available", "Baneh": "Traditionally made of  Sartal                     Plural for Utensils", "Bani": "Meaning Not Available", "Baradar": "Another (probably Urdu) word for brother used is Baradar similar to  Boey", "Barkat": "To progress in life. You can wish someone barkat", "Bat myaat": "Small amount of cooked rice rolled into a round or long oval shape in the palm of oneâ\u0080\u0099s hand   And pressed together.", "Bateh": "Means Rice but also used to mean Food or Meals - like Bateh Kyoteh (Did you eat your meals or can also be specifically used to ask Did you eat the rice that was in your meals)", "Batni": "A female Hindu lady", "Batta": "Cooked Rice. This word can also be written the same way to mean Pandit -  Kashur  Batta (Kashmiri Pandit)", "Batukh": "Means Swan or Duck - dont know if Kashmiri's distinguished between the two", "bavath   karun": "to  express", "Bazaar": "Meaning Not Available", "BHAGWAN": "Meaning Not Available", "bhatt": "Meaning Not Available", "Bichor": "Meaning Not Available", "Biscoe School": "Founded in 1880, it was the oldest school in Kashmir located in Shiekh Bagh near Lal Chowk.      C.M.S Tyndale Biscoe Memorial High School is an \"all boys school\" nestled in the beautiful valley of Kashmir, in the heart of the summer capital Srinagar.    The school was founded in 1880 and is the oldest school in Srinagar. The school was originally started by Christian missionaries to Kashmir and to this day has affiliations with the Christian Mission Society.    This site is dedicated to the fond memories of our school and how we remember it. The school motto of \"In All Things Be Men\" guides us through the perilous path of life. The inspiration that tells us to struggle even now like we used to in the cross country run, the regatta or the hiking to the mountains. The lesson that was taught was to be \"Men\" when we were children. The lesson that still stays in our hearts to conquer the difficulties, to be tough as \"Men\"....in all things.", "Bochhi": "Hunger", "Boey": "\"Boey hay chukh\" is a common saying when you want something from someone you try to call them their brother and invoke sympathy                    Means Brother", "Boey hay chukh": "Boey hay chukh\" is a common saying when you want something from someone you try to call them their brother and invoke sympathy", "Bokewachi": "Means Kidneys", "Bon": "Opposite of  Hyor  - means down or below", "Booth": "Adoption of the english word Boot - refers to shoes in general not just Boots", "Boumb": "Eyebrow", "Boze": "Listen", "Bozun": "To hear something", "Braand": "It is a raised platform before the main door of a house. Usually people had a few steps rise up to the main entrance. It was a key place for wedding ceremonies. Not it is replaced by a Verandah", "Braandh Kyen": "Meaning Not Available", "Braer": "Means a cat", "BRAHMASAR": "Meaning Not Available", "Bramh": "Meaning Not Available", "bramm": "illusion", "Bronth": "Means Front", "Bulyun": "Earthquake", "Bum choonth": "But sir!   Quince is a kind of pear                     same day loans  apply for payday loans  paydayloans  no credit check payday loans                    It is called \"Quince\" in English                      It is a yellowish variety of apples with slightly grainy core and is usually cooked with lotus Stem or brinjals.", "bumchoont": "Meaning Not Available", "BURHAN": "Meaning Not Available", "Burn Hall": "Meaning Not Available", "Buthi Buthi din": "Meaning Not Available", "butrath": "earth", "Buythih Byuthih Dyun": "Meaning Not Available", "Byaenyi": "Means Sister", "Byakar": "Have no work - idle", "Byakars che hath kar": "Ancient and true saying that means that a person who has no work has a lot of work", "Byekar": "A person with no work - probably from Urdu Bekaar", "Cancer": "Meaning Not Available", "Cancer e": "Cancer-e is a Kashmiri Pronounced version of actual disease called Cancer , However Cancer is also a slang in Kashmiri used to Curse someone badly ; like 'Cancer-e Puyov Hindustanas' means May India get Cancer . However it is generally taken as name of  disease which  is a group of diseases involving abnormal cell growth with the potential to invade or spread to other parts of the body.These contrast with benign tumors, which do not spread to other parts of the body.Possible signs and symptoms include a lump, abnormal bleeding, prolonged cough, unexplained weight loss and a change in bowel movements.While these symptoms may indicate cancer, they may have other causes.Over 100 types of cancers affect humans.", "Chaaklate": "Chocolate.", "Chaaman": "Means cheese or Paneer (Hindi)", "Chaan": "Chaan means carpenter in kashmiri                    A carpenter", "Chaas": "Means Cough", "Chack": "Meaning Not Available", "Chagul": "Meaning Not Available", "Chai": "Another word that was probbaly borrowed from Hindi - means Tea", "Chakunjal": "4 sided", "Chandram": "Means moon also known as  Zoon", "Char Chinari": "A small island in the middle of Dal Lake with  Chinar  trees on it. It only had 3 chinars in the 80s, one had died from what I recall", "charaganeh": "illumination    joy   happiness", "Charagbag": "Meaning Not Available", "Charvan": "Means Liver", "chatinov": "misfortune", "Chatun": "To cut", "che rumreshiun aay": "Meaning Not Available", "Cheent": "Cheent is a funny word used for a really funny fart noise that sounds like a trumpet. *frrt* LOL! Dude that sounded like a trumpet! #fart#really funny fart ...", "chenim": "Meaning Not Available", "Chill": "Cricket Wickets.", "Chinar": "Interesting tidbit from Wikipedia - In historic Kashmir, the tree was planted near Hindu holy places under names derived from the goddess Bhavani. Later in Muslim times it continued to be a major garden and landscape tree and dominates many historic gardens,[3] now generally called chinar. For example, a famous landmark in Srinagar is an island on Dal Lake where four chinar trees stand, named Char Chinar. As another example, a 627-year-old chinar tree has been found at Chatargam, Chadoora, Badgam district, Kashmir.                    A tree like the Maple tree - very typical to Kashmir", "Chini": "The Coals put in the  Kangri", "Chiper": "Meaning Not Available", "Chober": "Chober is a Kashmiri word used to describe a gorgeous girl. Nowadays Young Kashmiriz use this word for their Girlfriend.", "Chobir": "Chobir means a beautiful , attractive , cute, young lady", "Chok charvan": "Meaning Not Available", "Chong": "An earthen lamp - used to be filled with Oil  Teeel  and a Wick  Soyeth  made of cotton", "Choonth": "It is an Apple a similar sounding word is for something less pleasent", "Choonth Wangun": "A dish made of Egg plant/Brinjals  Wangun  and green sour apples  Choonth", "Choor": "Thief", "Chopaeyaer": "From all sides", "Chor": "Also pronounced differently to mean excessive - Noon kyah chu Chor                    Number 4 four", "Chot": "Opposite of  Zyuth  - means Short", "Chuk": "Means Sour", "Chuk Wangun": "A delicacy made from Egg plant/Brinjals  Wangun  by making them sour  Chuk", "Convent School": "Presentation Convent School is widely considered the best girls' school in the Valley. It was initially run by Irish nuns but now Indian nuns are administering it. The girls are well-behaved and always have a 'conventie attitude.' Conventies are always a class apart! Nobody can match them ;)                    One of the best all girls school. At one point it even admitted boys - a long time back", "Coonth": "Coonth is a kashmiri word which means apple in English... Common word used to all kinds of apples...", "Daan": "Prior to gas and kerosene stoves, every house had a wood burning stove that was used for cooking. It had 2 to 4 holes on top to keep your cooking pots and the wood would be inserted from the front. It would open up in a chimney to let the smoke out. It used to be cleaned with water and clay mixture. That process was called  Livun", "Daand": "Means Ox or in a derogatory sense means an Idiot", "Dab": "Dab used to be a popular fixture in old houses.  It was like a mini balcony, more like a window opened up with a ledge to the outside.  Old women would sit on these Dabs and talk to their neighbors even across the streets.  Obviously this was before the advent of the telephone.", "Dachigam": "It was a National Park", "Dachun": "Right (direction) - opposite of  Khohvur", "Daer": "Also means a beard - same pronunciation.                     Means window", "Dahg": "Means Pain", "Dal Lake": "Dal Lake is a lake in Srinagar, which is the second largest in the state. The lake covers an area of 18 square kilometres (6.9 sq mi) and is part of a natural wetland which covers 21.1 square kilometres (8.1 sq mi), including its floating gardens", "dambur": "earthen  hearth", "Dapaan": "trath", "Dapan": "\"Dapan\" is a secret news service in kashmir, every one says it before speaking any news. For eg. Dapan hu mood  English- Dapan he died. Its a secret which every kashmiri knows, its an agency which distributes news secret as well as a persons backbite. no one knows where it comes from.", "Daptam te pakaye": "Meaning Not Available", "Dar": "Meaning Not Available", "Darwazeh": "Means a door probably came from Urdu Darwazah", "Daryav": "Means a River -  Vyeth  or  Vitasta  was the river Jhelum that used to flow through Srinagar city and had multiple  Wariyah  wooden bridges  Kadel  over it", "Dasil": "A mason", "Dastaar": "Meaning Not Available", "DAV School": "Meaning Not Available", "Dazun": "To Burn - very subtle difference with  Zalun .  Dazun is accidental burning", "Ded": "Paternal Grandmother", "Deedaar Karun": "Getting to see someone or something very holy or pious", "Deh": "Means 10", "dejharoo": "We need beautiful designs for dejharoo & athore                     dejharoo ,a hexagonal ornament with provision for one chain to be drawn through two parallel tunnels ending in a tassel-all made of gold.Mother of bride gives the hexagonal ornament & mother in law the chain & tassel", "Dejhor": "Dejhor is a golden locket gift from parents to their daughter at the time of her marriage, which then is worn in a golden chain (athth) gifted by her in-laws.  The chain is worn in the ear & hangs from the hole in the upper-ear cartilage with one part going over the ear for support.  Dejhor- the locket- hangs at the bottom. There is also another section in the chain just below the dejhor.                    Traditional jewelry worn by Kashmiri married women - a distinguishing mark of identifying Kashmiri women. It uses 2 holes in the ear - one in the lobe and one in the main cartilage of the ear", "Deodar": "A type of tree and wood very commonly used in house contruction", "Devtah": "Means a Deity", "Dhaand": "Originally an OX but often used to describe a dumb wit", "Dhar": "Meaning Not Available", "Doar": "Means Hard -  Syun  chu Doar", "Dod": "The word for Milk would also be written in English like this but sounds very different. For Pain the o is elongated and for Milk the o is short                    Means Ache or Illness (  Byamaer )", "Doh": "Opposite of  Raath                     Means Day", "Doon": "Means Walnut", "Draav": "To leave - past tense Left", "droug": "Meaning Not Available", "Duakhear": "Duakhear   Blessings or good suplications", "DUL": "DUL is a metallic pot used in Kashmiri households as a utensil to store food items", "Dumaloo": "Dumaloo.....the awesome .....staple diet of Kashmir valley for centuries.....95 percent now don't know how to make it....modified and cloned by restaurants all over...sad indeed....but while I write ...It comes vividly in front of me....my Grand ma....especially used to prepare it.....medium sized potatoes...boil...remove the skin....now it is soft and hot....pierce it all over with a match stick or sweater needle....so that the spices and mustard oil goes inside it while preparing....then boil it in Mustard oil....then water spices...chillies etc....let it boil for some time....I am not good at cooking....have never prepared a dish or tea....pampered by my mother.....but this is my observation for AGES....see the Dumaloo is ready and served!......                    Probably the best known dish from Kashmir usually made very awfully and with cutup potatoes and with tomatoes by Indian resturants. The original dumaloo recipe does NOT use tomatoes for color and teh potatoes are whole not cut up", "Duniyah": "Same as the Hindi Urdu word with a Kashmiri twist - means the World", "Dyaed": "Means Paternal Grandmother - sounds like Daadi (Hindi)", "Dyakeh": "Forehead", "faetir": "A mad person", "Fakh": "Not always means gastric problem, it is upto the situation and humor how you use, e.g timav tull karas fakh, they spoiled the business. Su chu khandaan fakh the family is shit. Yath chu fakh yivan there is bad odour etc etc                    It is used when anyone has a gastric problem and throws a bad smell from his rectum and annoys everyone e.g waye em trove fakh means it is said when anyone gets annoyed says that he has thrown bad smell                    It is used when anyone has a gastric problem and throws a bad smell from his rectum and annoys everyone e.g waye em trove fakh means it is said when anyone gets annoyed says that he has thrown bad smell", "Farooq bhat": "Farooqbhat  is a prolific author born on October 7th 1997 in Ganderbal and has more than six publications in different sections of writing such as fiction and nature moreover he holds some of the major titles from Google and Goodreads", "Farooqbhat": "Meaning Not Available", "Fateh Kadal": "Meaning Not Available", "Fatun": "To burst - Yaed Phatiy - Stomach burst !", "finjaneh": "smallcup", "Frakh": "To pant heavy. Usually when I climb the stairs of Shankrachar mandar", "Fras kul": "Poplar Tree , towering and graceful. Dotted the ganderbal road and many courtyards.", "Gaam": "Means Village", "Gaamuk": "Villager", "Gaan": "GAAN  means a pimp affiliated with brokerage & prostitution                     Means Basement or maybe more generally storage", "Gaanth": "Eagle. Often found staring down from TV antenna.", "Gaash": "Aash vaasa gaash rassai                     Means light or sight", "Gaav": "Means a Cow", "Gaaw": "Means Cow", "Gadeh": "Means Fish", "Gadeh Batta": "A festival where Fish  Gadeh  and Rice  Batta  are offered to the house deity  Grah   Devtah  (from what I recall).  It was left under a wicker basket  Tooker  and with a  Chong  for light overnight.  In the morning, a piece of the fish and rice had usually been eaten by someone !", "Gagarai": "Thunder usually follows a  Vuzmal", "Gagir": "Gagir is a Kashmiri term meaning Mice. It is often used as Nickname to small kids in the Family.", "Gagur": "Means Rat", "Gamuk": "@ TANSEER- Little knowledge is a dangerous thing. Gamuk It is 100% kashmiri word and it means A Villager.                     THIS WORD IS NOT KASHMIRI ITS SHINA LANGUAGE WORD WHICH IS SPEAKS IN GILGIT BALTISTAN NORTH OF PAKISTAN GAMUK MEANS ICE                    From the village - refers usually to people from villages", "Ganda": "The Kashmiri word is actually  Makur                     Probably from hindi - Ganda - Dirty", "Ganda Bacha": "Bad Boy - (thats me) - catching up on the top contributor (watch out)", "Gandakh Dabe": "Match Box. Gandakh is the chemical on the stick", "Gandakh Tuj": "Match stick", "Ganderbal": "Meaning Not Available", "Gangbal": "A famous lake at approx. 12000 feet near Naranag and the Harmukh peak", "Garam": "Same as the Hindi word - means Hot", "Garid": "Means Dust", "Gash": "Gash gachun", "Gassih": "Grass", "gat zol": "It implies when the sky is bit darkish with no sun.. alternatively it can also be used to imply \"keeping in dark\"", "Gate zoul": "Goutt' or 'Gotth' refers to 'Darkness'  'Zoul' refers to 'Light'                    Darkness", "gateh  zole": "lightning   speed  misfortune", "Gawon": "Singing, sing a song means guwon bath wan", "Geerun": "To swoon - or feel faint", "ghev": "Clarified butter", "Gilas": "It has two meanings:  1. Glass tumbler (ar any tumbler) - probably from the English worrd Glass  2. Cherries", "Gilaseh": "Probably from the English word Glass - it is a tumbler or glass", "Gindun": "To play a game", "Girda": "Made by a  Kandur  - a bread baked in an oven, eaten for breakfast with a  Lavasa", "Goal": "Same as Hindi - means round", "Goed": "Means joint (body joints usually)   Goedan   Cham   Dahg", "Gogji": "Meaning Not Available", "Gogjibagh": "Meaning Not Available", "Goji patti": "Savoury made from peanut and jaggery.", "Golaab": "Meaning Not Available", "Goole": "It means bullet  \"Aaye Goole\"", "Goor": "A milkman", "Goshtaba": "A finely minced meat made with curd or yogurt - simply delicious", "Got": "Opposite of  Gaash  - means darkness", "Goye khash kash": "Meaning Not Available", "Grand": "Akh   Ze   Tre   Chor   Panch   She   Sath   Aeth   Nav   Deh                     Means \"count\"", "Granznaavun": "To count - the act of counting", "Grateh": "It was a hand or water run mill (as in mill stones) - back in the old days masalas like  Shonth  and  Badiyan   Marchwangun  etc were crushed in these Gratehas at their homes and later in special electric driven Gratehas", "Gruhud": "Meaning Not Available", "Gruhun": "Means Eclipse - probably same root as Grahan Hindi word", "Gupan": "Meaning Not Available", "gupun": "Gupun  means fool", "Gushtaba": "Or just  Goshtaba", "Gyavun": "Means a Song", "Gyod kaden": "MEANING: TO WASH THE FEET", "Haakh": "Haakh - the dish that feels like home â\u0099¥ï¸\u008f                    Haakh-It is known as Collard Greens in English.It is a common but a favorite vegetable of most Kashmirs.Various types of dishes are prepared in Kashmir like Maaz te Haakh,Tsamen te Haakh,Haakh Gaade etc.The most common dish among the Kashmiri Hindus is Haakh Rus.                    Another delicacy - green leaves comes in two forms - one with  Monji  and one just as Haakh also called Khanyari Haakh", "Haaput": "Meaning Not Available", "Haarun": "Means To Lose - opposite of  Zyanun", "Haash": "Meaning Not Available", "Habakadal": "Any chance this area was named after Habba Khatoon? Or was it the other way round, or no relation?", "Habba Khatoon": "Famous poet", "Habba Khatoun": "Meaning Not Available", "Haenkal": "A latch used to close or lock doors or windows", "Halwoy": "Probably from the Hindi word Halwai - person who makes sweets", "Hanglou karyo shupie sieth wav": "Meaning Not Available", "Hangul": "Endangered species from Kashmir. Also used to describe a dumb wit", "Hanuman Mander": "Meaning Not Available", "Hapat Yaraz": "Meaning Not Available", "Haput": "Haput is actually a wild animal in washmiri .in english its bear .                      \"Haput\" name of my company in Vancouver, Canada. Named after the bears of Kashmir.                     Haput's were very common in Kashmir.  Dachigam park had some brown and I believe black bears                    Haput means Bear", "Hareh": "These are sea shells - people you to play with them on Shivratri before they had XBoxes", "Hari Parbat": "More history from Wikipedia:  According to legend, the Hari Parbat hill was once a huge lake inhabited by the demon Jalobhava. The inhabitants called on the goddess Parvati for help. She took the form of a bird and dropped a pebble on the demon's head, which grew larger and larger until it crushed the demon. Hari Parbat is revered as that pebble, and is said to have become the home for all the gods of the Hindu pantheon.     Another version of the myth says that two demons, Tsand and Mond, occupied the fair valley. Tsand hid in the water near the present location of Hari Parbat and Mond somewhere above the present Dal Gate, and both terrorized the people of the valley. The gods invoked Parvati who assumed the form of a Haer (myna) and flew to Sumer, picked up a pebble in her beak, and threw it on the demon Tsand to crush him. The pebble grew into a mountain                    A hill in the middle of Srinagar with an old fort and the Parbat temple.  According to Wikipedia -   It is the site of a Durrani fort, built in 1808. It has the famous Shakti Temple on the western Slope and Muslim shrines of Khwaja Makhdoom Sahib and Akhund Mullah Shah on the southern slope. On the southern side of the outer wall there is a Gurudwara, which commemorates the visit of Guru Hargobind", "HARISHORE": "Meaning Not Available", "harkar": "Harkar or Harkara was tittle given to those who were in police service. Actually Harkar means to do every kind of work .Harkara were police officials n they were collecting land revenue , solving public matters etc . that's​ why they were calling Harkara                    Harkar or Harkara was tittle given to those who were in police service. Actually Harkar means to do every kind of work .Harkara were police officials n they were collecting land revenue , solving public matters etc . that's​ why they were calling Harkara", "Harkath": "Means movement", "Harmukh": "Harmukh is a mountain which is believed to be Adobe of Lord Shiva according To Kashmiri Pandits.", "Harud": "Means the season Autumn or Fall", "Harun": "To lose", "Harwan": "Meaning Not Available", "Haspatal": "Kashmiriazation of Hospital", "Hatai wai": "Kashmiri version of \"awwww\". Can be used when you see/hear something:  1. Cute  2. Sad  3. Emotional  And lots of emotions as well :)                    It is a saying like \"oh dear\" not exactly the same meaning but similar intent. A sigh of resignation used by women", "Hatakh": "Like  Var  - but means more to be slighted and then upset due to that sligth", "Hatay": "What is the English translation of hatay - just wondering - more like a Hey or Yo?", "Hatay kyah goam": "Somewhat equivalent to \"oh my god\" literal translation is \" Hatay  what happened to me\"", "Hath": "Correction means hundred - you could have  Ze  Hath - which means 200                    Means 100", "Hawaleh": "To entrust - Hawaleh  chuv  - it is now entrusted to you", "Hazratbal": "Meaning Not Available", "Heemal ti Nagray": "Meaning Not Available", "Herath": "Meaning Not Available", "Herwan": "Meaning Not Available", "Hochh": "Body part - the wrist", "hogaad": "This is a dry fish that smelled like crazy but was a delicacy and eaten by Kashmiris", "Hogaad bum": "Meaning Not Available", "Hogad": "Meaning Not Available", "Hokh Syun": "General category of foods that were dried in the summers to be eaten in the Winter, things like  Aaleh   Wangun   Tamater .  Since the valley was cut off from the world for mnths in the Winter, this was a very ingenious way for people to store food in the  Ryetkal  (Summer) so that it did not decay and could be eaten in the  Wandeh  (Winter)", "Hokhaymuth chukh": "Often said to people to say people had lost weight - it wasn't a good thing like it is today - loss of weight signified lack of food or even poverty", "Hongyaen": "Means Chin", "Hoon": "means dog                       Means Dog                    Maanay Kuta", "hoone loot": "Meaning Not Available", "Hotmut": "Rotten", "Ho%C4%ABn Adij": "Dogs bone, a proverb used to refer to someone that doesn't get over his words.", "Hundur": "It aslo means anything cold.. same as Turun. However it is used in particularly in south Kashmir", "Hyaer": "Stair", "Hyakath": "Means Strength - Hyakath cham ne ruzmut", "Hyamath": "Strength", "Hyandbyend": "Watermelon", "Hyatyun": "100 Rupee note", "Hyeng": "Means horns (the ones on animals heads not the instrument)", "Hyor": "Means Up", "Hyor nai pilai, zangay zilay": "The converse ! If you want to do something good there always will be crooks to pull you down . Kashmiris no exception.                    It sounds more like a desperate attempt by a short and weaker person to at least inflict some damage on a taller and stronger opponent                     Interesting                     \"Hyor Nai Pilai, Zangay Zilay\" is a Kashmiri proverb which literally means \"I may not be tall enough to reach up, but I surely can claw and scrape your legs\". This proverb in many ways reflects the general Kashmiri approach and attitude that many generations have adopted over time. It's about making the best of the situation and not letting your weakness become the handicap!", "Hyuhur": "Means Father-in-law", "Hyush": "Mother in law", "Jaan": "Means Good - Jaan Karuth - You did good", "Jaanaan": "Probably means a loved one or lover", "Jajeer": "Hookah", "jan marg": "it is a sort of scolding", "Jangur": "Meaning Not Available", "January": "Meaning Not Available", "Javani": "Youth of life. You can wish for  barkath  and Javani", "Jawahar Nagar": "Meaning Not Available", "Jiger": "Heart", "Jomm": "JAMMU - Winter capital of J&K", "kahwa": "Kahwa or  Mogilchai  is a sugary tea with no milk made with tea leaves, cardamom, cinnamon and almonds - very aromatic and delicious", "Kailh": "It means Banana", "Kajwath": "Stone crusher used with a  wakhul .", "Kal": "Means Head", "Kal doad": "Meaning Not Available", "Kalam": "Same as the Urdu word - prior to Pens - they were used with some kind of white ink on a  Mashikh", "kaldod": "Comprises of two words  Kal  and  Dod                     Kaldod  means Headache in kashmiri. Usage :  Ma tul me kaldod ( Dont give me a headache)", "kale doud": "kale doud means headache", "Kaleh khyotham": "Literal translation is Eating my head - Bothering someone", "Kali": "Kali gov Kali....Kali chukh walah(Genius)...", "Kaliyah": "A yellow meat dish - made tender than  Roganjosh", "Kalkharaab": "Khalkharaab is newly invented word in Kashmir used generally by boys but girls also now started using it. It is used by young generation mostly to denote Genius becoz the meaning of kal means head and kharaab faulty which automatically denotes that he/she is out of this world eg su chu kalkharaab nafar meaning that he is genius                    Genius", "kalle": "Awesome.", "Kamzor": "Probably from the Urdu word - Weak", "Kandur": "Baker who specialises in making Kashmiri bread like Girda, telVor , katlam ..", "Kanger": "Same as  Kangir                     Kanger is the traditional earthen pot in which charcoal seethes to create a portable heating device for winters", "Kangir": "Famous \"portable heater\" - refered to as  Kangiri  outside Kashmir.  Probably the best example of Kashmiri ingenuity to deal with the cold.  Even in the days of the iPhone, there is nothing that will keep you warm while walking around in the cold like the  Kangir", "Kangri": "Same as  Kangir  or  Kangri  or  Kangiri", "kapar  zoveh": "unavoidable", "Karan Nagar": "Meaning Not Available", "Karyin": "A flat trowel used by a  Dasil  for masonry work", "Kasheer": "Kasheer is the  kashmiri name of Kashmir. Maej kasheer  is a word in kashmiri which literally means\" mother kashmir\" in english.", "Kashtawar": "Kashtwar means \"Kishtwar\" which is a city in Kishtwar district of Jammu and Kashmir.", "Kashur": "Also written as  Koshur  - means Kashmiri IN Kashmiri", "Kashur Mashur": "\"Kashur Mashur\" meaning is \"Kashmiri is Popular\". This is a title of a Jammu based Sikh girl Zara (character name). Her real name is Sunaina Chaudhary.", "Kashyap": "According to Indian Vedas, the fiefdom of Kashmir originally belonged to Sage Kashyap who was the descendant of one of the Supt-rishis created by Lord Brahma.   More than 5000 years ago, it was originally known as \"Kashyap-Mira\" and later it's name was shortened to Kashmir.", "Kasibh": "A skill - usually in a trade like a blacksmith", "Katel": "Surprising Kashmiri probably doesn't have a word for Murder so we use this Hindi or Urdu word instead", "Katlam": "Another baked bread by a  Kandur", "Kaw": "Means Crow - also a last name", "Kesim": "Means type (of) Kyetyah Kesim chi - How many types are there", "Khabar": "Khabar is  News", "Khabri Khouch": "Informer", "Khaeli wether": "Leaves of lotus", "Khalan": "To stir - Khalan dyinh", "Khalkharaab": "Meaning Not Available", "Khandaar": "It is Khandaar with a aa sound - this means husband. This word is not used by Pandits but used by Muslims                    If it is 'खान्दर' i guess it means marriage.                    Husband", "Khandar": "Marriage", "Khander": "A kashmiri wedding.                    or  Khandar                     Marriage", "Khanmoj kur": "Meaning Not Available", "Khar": "Means Donkey, written with style as Kher - the popular last name.", "Khare": "KHARE a Kashmiri word means donkey in English ,used as abuse when said KHARE HU CHUK most used by teachers in Kashmir university to refer their students as  synonyms to donkey ,for not behaving well", "Khashir pajamas manz zung sinan": "Interfering", "Khatarnakh": "Means Dangerous - this is probably just straight from Hindi (with the usual Kashmiri spin)", "Khe": "Means Eat - related words  Khyon", "Khin": "Means Snot - mucus coming out of our nose", "Khoas": "It was the equivalent of a cup usually with no handle though used to drink tea and milk and made of  Sartal", "Khochun": "To be afraid", "Khohvur": "Left (direction)", "Khor": "Not to be confused with  Khoor  or  Khir  or  Kheer  or  Kher                     Another variation of this word means someone who is naughty.  It is hard to write down the nuances in pronunciation when you type Kashmiri words in English.                    Means Foot", "khoshik": "khoshik  is one who doesn't comprehend or doesn't want to come conclusion and therefore things randomly and often shouts aloudly.in english it is related with word stubborn example if someone says to anyone if he doesnt understand and shouts....cxe chukh khushik...you are khushik...", "Khoshkyeth": "Not sure if the true translation is Irritation or something else like Bad Habit as in Khoshkyeth Chas", "Khotmut": "Meaning Not Available", "khour": "Khour is Heel, not foot. Foot is  Khor                     khour means foot", "khrav   hore": "awful   play                    hapat   yaraz                    hunch   man                    pechi  daar                    wooden   slippers   worn   on   feet", "Khyin": "Meaning Not Available", "Khyon": "To eat", "Koang": "Also called Zafraan                    Saffron - a cash crop exported widely from Kashmir", "Kokar": "Refers to the male Chicken or Cock.", "Koker": "Means hen                    A female chicken  kokar", "Koker poot": "Oh lol well it means a chicken...but some lady i know used this word to describe the bridegroom she just saw... Cause he was small n skinny... Said yi chu poot hyu...lol will never forget that ð\u009f\u0098\u0082                    Chick. Cute little ones .the bird to be specific", "Kokur": "Means cock", "Kolohai": "A mountain and a house in Biscoe school", "Koon": "Corner", "Koor": "Means Girl", "Koshur": "Means Kashmiri IN Kashmiri - also written as  Kashur", "Koth": "Means Knee -  Kyoeth  Phutravay", "Kotur": "Pigeon . Also a common surname.", "Kout": "It means a  child, young boy", "Krakh": "A load shout. Mostly used by mom to call kids back from play.", "Kreand": "The word can means an oil drizzler but Kashmiri cuisine does not use a drizzle of oil ! The implement is this shaped more like a vertical soup spoon used to dip into a traditional oil holding pot  called â\u0080\u0098Tili Vaerâ\u0080\u0099.  Interestingly the latter can also mean a person who knows everybody else( well networked) perhaps due to the fact the every household will have a â\u0080\u0098Tili Vaerâ\u0080\u0099", "kripen": "leach  habited", "KRISHNASAR": "Meaning Not Available", "Kruhun": "The color Black", "Kuind": "Means Iron (used to smooth clothes, sheets, etc)", "Kul": "Means Tree", "Kulya kyamyu phutnovnakh - paneni myavan": "\"Tree who broke you - your own fruit\" - how poignant and how true !", "Kunear": "Loneliness", "kunzeh   trout": "bunch   of   keys", "Kyanih Phol": "Pebble", "Kyen": "Means a Rock", "Kyoeth": "Plural of  Koth", "Kyom": "Means insect or worm or used in the phrase \"Kyom Aasun\" which translates to having impatience generally of a mischievous nature", "Kyut": "Not sure if this is a word used by itself or just in conjunction with  Raath", "Laad": "Laad was/is a fold of the cloth on a long  Pheran . I am not sure of the purpose but it seems to be common in younger kids who would be given a Pheran a few sizes long so that it could last a few winters  Wandeh  (is Winter)", "Laal": "Drool", "Laanat": "Meaning Not Available", "Labaan": "To find. A common saying was Labaan Chukh", "Labh": "Means Wall", "Ladnav": "Meaning Not Available", "ladur": "Same as  Lyadur  - a better phonetic representation                    Ladur is the name for color yellow", "Laer": "Cucumber", "Laet": "Laet = Tail", "Lagay Balayi": "A favourite saying translates to someone taking on  Balayi  on their behalf - I.e. protecting them from  Balayi", "lahvun": "mild   roasting", "Lal": "Birds getc down lal                    Birds getc down lal", "Lal Chowk": "This is the center of the Srinagar city.  According to Wikipedia - Lal Chowk is a city square in Srinagar in the Indian state of Jammu & Kashmir. Lal Chowk was named so by Left-wing activists inspired by the Russian Revolution as they fought Maharaja Hari Singh.It is a traditional place for political meetings with Jawaharlal Nehru, India's first Prime Minister, Sheikh Abdullah, Kashmir's first premier and various other Kashmiri leaders having addressed people from it.", "lal ded": "", "Lal Ded Hospital": "Meaning Not Available", "lala argame bandipora": "Meaning Not Available", "Lalmut lai": "Spoonfeeding                    Spoonfeeding", "Lanath": "Meaning Not Available", "Larun": "To stick - variation is Laaran", "lashi   kon": "A    piece   of   conifer   tree   burnt  for   lighting  in  remote  areas", "lassiv": "excellent! thank you                    Lassiv ..means to prosper", "Lastam ti labniye khastam": "Meaning Not Available", "Lasun": "Meaning Not Available", "Lath": "Lath means \"Kick'.", "Lavasa": "A bread that is like a Naan, made in a clay tanodor like oven by a  kandur . It is whiter in colour compared to a  girda", "Lett tulith gaeb": "Show off, she is showing off so much, yeah she is let tulith gaeb", "Liath": "Liath means penis in Kashmir famously known as kuchir", "Lithnavun": "No, it is not Lithuania - it means to smack around usually through a beating - Mye kyah se Lithnov su  nafar", "Livun": "A cleaning ritual to sanitize  Shrooch  a house or  Daan", "Lol": "No this doesnt mean Laugh out Loud - the Kashmiri meaning is somewhat like love - more like longing", "lolar": "lolar means beloved (female), somebody one longs for. The rem of address is: lolariye.  Example: kan thavi lolariye (the refrain in a lyric): listen carefully, [my] beloved", "lolar lolariye": "Meaning Not Available", "Lolmut Laey": "To pamper someone", "lone": "I love kashmir", "Lookh": "Means People related word  Lookan  - Yimay lookan kyah sana gav (What happened to these people)", "Lyadir": "Turmeric (spice) Lyadir comes from  Lyadur   Rang", "Lyadur": "Yellow", "Lyej": "A round pot, mostly earthen used to cook food on a  Daan", "Lyekh": "It means a bad word or insult - it itself is not a bad word but refers to the whole category of bad words", "maay": "Affection", "Machar Wangun": "Meaning Not Available", "Machh": "Ground or minced meat sausage shaped lamb dish made in a red curry", "Madraer": "Sugar", "Madur": "spelt better as 'modur' as in \"मोदुर\"                    Means Sweet opposite of  Chuk", "Maej": "Maej sharikay kar dayah - a popular bhajan                    Means Mother", "Magiz": "Brain - \"Tala Magiz ma  khe \" literal translation - please don't eat my brain", "Mahadev": "A peak - also a house in Biscoe School. There was also an annual trek to the top for 10th class if I remember right", "Maharaz": "Maharaz in kashmiri means \" Groom\"", "Mahraaz": "Groom, bridegroom, the male getting to be married", "Mahren": "Bride, lady getting to be married", "Maisum": "Meaning Not Available", "Makai": "Means Corn", "makai kashur": "Meaning Not Available", "Makai Waet": "Corn on the cob", "Makaneh": "Means House", "Makur": "Means Dirty", "Malai": "Just like the hindi word - the cream from the top of the milk", "Malalah": "Meaning Not Available", "Mallinson School": "Yes I know a lot of interesting things about this School - maybe I will write a book someday.  For now, it is a Girls school next door to Biscoe (hope it is stil there and stil only for girls)", "mandinan   shyam": "unexpected   horrible   misfortune", "manjh": "Meaning Not Available", "manz  athas  maanzi  char": "wind  fall", "Manzimyor": "Manzimyor (middle-man) who suggests suitable matches.                    Matchmaker - a role that is probably extinct or close to extinct", "Mar Pech": "Hookah used by Kashmiri Pandits", "Marchi Wangun": "Gree Chilli. The Ch in Marchi sounds as in Chaman - paneer. You can and Vazul to it and make it Red chilli", "Marchwangun": "Someone who is very fiery... usually a woman... Marchwangan hish chakhð\u009f\u008c¶ï¸\u008f                    Red or Green Chili - either whole or ground dry chili powder", "Mardeh payjaman chukh zung divan": "Means trying to do something beyond your capability (Mans pajamas)", "Marech": "it is black pepper                    Pepper", "Mared": "Probably from the Hindi/Urdu word Mard - means Man", "Mashikh": "A tablet (not an IPad tablet), but a flat dumb tablet used for writing before paper and pen were prevelant", "mazdaar": "Mazdaar means tasty in kashmiri", "Mazoor": "A laborer - probably derived from Mazdoor (Hindi/Urdu word)", "memer": "it is actually a lyaath with large size", "Menga": "Brain. Menga daag used to describe the painful state of mind.", "Mietre mecchh": "Stuck on your back. Like some children do not letting you go anywhere.", "Mishul": "Cuticle", "Miyakut": "Sheep.                    Sheep.", "moaj": "moaj means mother that gives us moma (milk) in bachpan                    moaj means mother that gives us moma (milk) in bachpan", "Moal": "Means Father", "Modmut": "Modmut means \"Dead\"", "monj": "looking for english name for ganth gobi", "Monji": "Meaning Not Available", "Monyh": "Means Kiss. -  Wala Monyh karay (come let me kiss you)", "Mooj": "Mooj is a Kashmiri word.its means mother in English and maa in urdu", "Mot": "Meaning Not Available", "muhul": "A  wooden   pole  used  for   paddy  husking", "Muj": "Muj meaning is \"Raddish\". It is famous kashmiri salad.", "Mujadalai": "Meaning Not Available", "Mush": "Mush means punch", "Mushikh": "Ath wanan thuss 😂                      Smell", "Myakath": "A lamb. Furry white ones.", "Mye kyah bi chu Heart": "A funny saying used by Kashmiri women who didn't really know English well, probably meant to say I have a heart problem", "Myekaraz": "Myekaraz refers to scissors                     Myekaraz refers to scissors", "Myengi Dag": "Literal translation - Brain Ache, but used as a figure of speech to mean Head ache caused by bothering someone", "myon marun chui": "Meaning Not Available", "Myon Marun Chuy": "Meaning Not Available", "Naale-secchan": "Safety pin!", "Naar": "Naar is a kashmiri word which means fire ......it is also used an abuse e.g naar hindustanas                     Means Fire", "NAAR DEMAIY DARETH": "YOU LOOKING HOTTY", "Naav": "Naav is pronounced the same way for two words:  Name and Boat", "Nab": "Means Sky", "Nabozun chuy gomut": "Meaning Not Available", "Nadur": "Root of the Lotus - a Kashmiri delicacy, cooked in many ways - delicious", "nadur monj": "Nadur Monj is a kashmiri dish prepared on special occasions.Every Kashmiri loves to have it.", "Naer": "Means  Arm", "Naeyn": "Means maternal grandmother - related to Hindi word Nani?", "Nafar": "Person - gender neutral", "Nageen": "Meaning Not Available", "Nai": "Meadow for grazing of cattle during summers", "Nakareh": "Means Bad", "Nakvor": "Nostril", "Nalehmot": "Means Hug", "Nam": "Means Nail", "Nam Namath": "Means 99", "Nangeh": "Naked", "Naram": "probably a straight hindi word copy - means soft", "nare": "Go -  Nyabaer   Nare", "Nas": "Means Nose", "Nasir": "The One Who Helps  Helpfull Man  The man with Heart", "National School": "Meaning Not Available", "navun te phalun": "Meaning Not Available", "nebah  trath": "bolt  from  blue", "nebra dopnam andar atchun": "Meaning Not Available", "Neel": "Has a couple of meanings - it used to be a blue liquid added to white clothes to make them less yellow and it was also the term for kids when they would turn blue when crying", "Nehru Park": "Meaning Not Available", "nengroo": "Nengroo is not any word it is a funny caste hahaha                     Are you sure it is a Kashmiri word?                    I wanna know the meaning of Nengroo                    I wanna know the meaning of Nengroo", "Ner": "Arm that extends into  athe `", "News": "Did my part 619 words now                    Finally broke into the Top 3 - phew !                    At 500 words now - took 12 days from 400 to get here, lets see how fast we get to 600 - the race is on                    Yeah - 400 words !!                    Sorry - twitter disabled the account - assume excessive tweeting was the reason - that is good news anyway. I will find a better way to keep people updated.                    Follow on Twitter kashmirpedia to get the latest words and comments                    It is hard to break into the Top 5 - but I will keep trying !!!                    I totally agree on how addictive it is !!                    I love this site - thank you for creating this. It is so addictive, once you get started you cant stop. The words just keep coming as your memories traverse the neural pathways                    Added the ability to search for an English word and get the Kashmiri equivalent. As you can now see there are 2 search boxes on the top of each page. Use the box called English Search to use this new feature.                    Yeah !! I am No 1                    Audio recording for the name/term OR even Comments is now ready and live !!!  Right now you can only listen to what you record, making it available for others will be coming soon.                    Don't like the name you used to comment? Then delete your cookies and use another name.   Use the same email to get credit for the Top 5 contributor                    Also it would be good to add comments as audio?  Me English not good here so requested and my type bad too. ;-)                    Me too - I want to help my fellow Kashmiri's with audio recordings.   So please grant me the permissions.                     Sure Kapil - audio recording needs Flash installed (iphone wont work - firefox/chrome on desktop with a mic), as you are logged in using your email, I will setup a link for you to add an audio next to each word. FOr now it will overwrite the previous recording (if any). I will get a feature for adding new audio clips as comments soon.                    Add me to audio                    Here is a sample of an audio file  Roganjosh  Internet Explorer doesn't work, use Chrome or Firefox instead.   iPhone safari works too !!                    Since it is hard to decipher English written Kashmiri words, I added audio files for some words.   If you are interested in adding audio, comment on this thread and I can provide you the access", "Nishat bagh": "Meaning Not Available", "Noat": "It is a vessel with a narrow neck and a big round body used to carry water before tap water was available. Made like pottery usually but also made of  Sartal  or other metals", "Noon": "Means Salt", "NRK (Non Resident kashmiri)": "It is that ethenic population of kashmir which is resident outside kashmir just lik NRI ( non resident indian) More comments please", "Nyabaer": "Outside - Nyabaer  Nare", "Nyabar": "Out opposite of  Ander", "Nyaerun": "To leave", "Nyandir": "Sleep", "Nyethir": "Meaning Not Available", "Nyosh": "Daughter in law", "Nyoth": "Thumb", "Nyuk": "Nyuk is a kashmiri word used to describe a person who is short eg: \"Quyoom Badshah che nyuk hero\"                    Means Thin", "Nyul": "Two meanings - Blue and Raw as in raw food", "Oat": "Means Flour - any kind - wheat, rice, gram", "Obur": "Cloud or Cloudy", "Obuyj": "A vegetable = not sure of the English term", "Om dod": "Simply milk that cow gives directly                    Simply milk that cow gives directly", "Onguj": "Means finger", "Ooluv": "Potato", "Oon": "Blind - Oon chuyih pyomuth? (Are you blind?)", "Oubur": "Means Clouds or Cloudy", "Oush": "Tears", "Paan": "Means Body also used in the phrase  Paan   Maarun", "Paethir": "A drama or play or skit", "Pahaad": "Same as hindi - Mountain", "Pakh": "Means Walk - related word is  Pakun", "Pakhe": "Fan.  An electric fan or wings of bird", "Pakun": "Means \"To walk\"", "Palav": "Clothes", "Palne": "Meaning Not Available", "pamposh": "Lotus", "Panchah": "Means 50", "Panun": "One's own.", "Parbath": "A famous temple on a hill, also called Hari Parbat", "Parimahal": "Meaning Not Available", "Path Kaalih": "In old times", "Pather": "Pather travun - to drop on the floor                    Down as in \"down on the floor\"", "Pavun": "Meaning Not Available", "Phati Wangun": "Meaning Not Available", "Phatwan waad": "It means \"Quarles\"", "Pher": "Pher means three hours..", "Pheraan": "To miss - pheraan chumh", "Pheran": "A thick long woolen garment worn by men and women - kept your whole body warm.  It would go down to below your knees in most cases.  The women version had embroidered neck and cuffs.", "PIA Tawan": "Museebat padnaa                    It is pronounced more like Pyoyah or Pyoyuih Taavan                    scolding                    Scolding", "Pilyam natai chekye gayem": "Grapes are sour", "Poar": "Aiseh oos choor poar makaneh - We had a 4 storey house ;-)                    Storey - \"Tre Poar Makaneh oos asi Kashirih\" - We had a 3 storey house in Kashmir", "Pond": "Two meanings - pronounced differently:  1. Sneeze  2. Old Currency from Maharaja or British time", "Ponyh": "Means water - all kinds even drinking water which is a subste  Tresh", "ponz": "ponz means monkey", "Poonz": "Poonz means monkey", "Poosh": "Flower/Flowers also male scrotum", "Pooshmal": "Garland of flowers.", "Poozh": "The inner cloth lining of a  Pheran . Without it the Pheran would not be warm", "Posh": "Posh meaning ?", "Pot Phaerun": "To turn around", "POUHAT": "POUHAT IS THE ORGAN OF A HUMMAN BEING                       HAHAHA                    POUHAT TIPICALLY MEAN \"EXHAUST\".WHEN SOMEONE TOLD YOU ALOT OF THINGS AT THE SAME TIME HE USUALLY DONT DO HIM SELF THERE WE USE A SPECIFIC WORD POUHAT.", "Pragaash": "A popular day time informative program from Radio Kashmir", "pragav": "a   shallow   boul   to   hold   water                       bason", "Prakhuth": "Meaning Not Available", "praraan": "Meaning Not Available", "Prepyun": "Meaning Not Available", "preth": "means to smash especially with a stick", "Puj": "A butcher", "pulhoor": "pulhoor is a footwear used by our ancestors that was made up of grass or something like that", "Pulhor": "Before shoes or sandals, this sandlas made of grass  Gassih  were used. A highly decorative version of these are still used in traditional Hindu Marriage ceremonies as one of the hundred things used in the marriage", "Pun": "Two meanings:  1. Thread   2. A hindu ritual in autumn when people make  Roth", "pyaraan": "Pyaraan means waiting", "Pyater": "Means Uncle", "Pyath": "Means On Top", "Pyutur": "Means Cousin", "Raat Mogul": "A night owl", "Raath": "Opposite of  doh                     Or it also means yesterday                    Night - Raath  Kyut  (at Night)", "Raath Mogul": "Meaning Not Available", "Raatmogul": "Meaning Not Available", "Rainawari": "Rainawari is place in Kashmir", "Raj Bagh": "Meaning Not Available", "Rajguru": "Meaning Not Available", "Rakhus": "More like Rakhyus                    Demon .", "Rasul Mir": "Meaning Not Available", "Rateh Mogul": "A person who is a night owl", "Ravmech": "Sometimes used for someone who is lost in imaginative world.                    Another tense is  Rovmuth   Chukha ?                    The Ch in ravmech sounds like chaman- paneer                    Lost . Also used with  vaath", "Ravun": "Lost or \"To be lost\" or Ravan the demon from Ramayan", "Rawalpora": "Meaning Not Available", "Razmah": "It means Red Beans", "Rista": "A meatball similar to the  Gushtaba  - smaller in size but with Red coloured curry instead of the more grey coloured curry in the Gushtaba", "roganjosh": "It is one of the main dishes of the Kashmiri multi-course meal (the \"Wazwan\"). It consists of braised boneless lamb chunks cooked with a gravy based on browned onions or shallots, yoghurt, garlic, ginger and aromatic spices (cloves, bay leaves, cardamom, cinnamon). Its characteristic brilliant red color traditionally comes from liberal amounts of dried Kashmiri chiles that have been de-seeded to reduce their heat: these chillies (whose flavor approximates that of paprika) are considerably milder than the typical dried cayenne chiles of Indian cuisine. The recipe's spiciness is one of fragrance rather than heat, and the traditional dish is mild enough to be appreciated by Western palates that may not have been conditioned to tolerate the heat of chillies. In addition, dried flowers or root of Alkanna tinctoria are used in some variants of the recipe to impart a crimson color. Saffron is also part of some traditional recipes.                        Rogan josh (or roghan josh) is an aromatic lamb dish of Persian origin, which is one of the signature recipes of Kashmiri cuisine.Rogan josh thus means cooked in oil at intense heat. Another interpretation of the name rogan josh is derived from the word rogan meaning \"red color\"  and josh meaning passion or heat.", "Rood": "Means Rain", "Roth": "A sweet bread made with flour, ghee and ajwain (?) seeds and fried in Ghee on the day of the  Pun", "Rovmuth": "To be lost", "Ryatkol": "Summer as in Ryatkalis manz kya so oos kus mazeh yivan", "Saas": "Means thousand", "Sabez": "The colour Green", "Safakadal": "Meaning Not Available", "Safed": "White", "Sahgul": "Meaning Not Available", "Sandya wakhith": "Dusk time", "Sangarmal": "Meaning Not Available", "Sari sameyev eksi razyi lamevew": "Meaning Not Available", "SARISHORE": "Meaning Not Available", "Sarneyh": "Meaning Not Available", "Sartal": "If I remember right, Sartal utensils were shined or fixed using  Kalayi  every once in a while                    It is an alloy (not sure of the composition) used to make various utensils such as  Thaal   Khoas   Gilaseh", "saunduhr": "jeweler", "Shaal": "Jackal", "Shaam": "Evening - same as the Hindi word", "Shaansh": "Breath - Shaansh  Khasinh  - to be breathless", "Shahmat": "\"Shahmat\" literally means bad-luck .However it is used in different contexts to show either to show disapproval/frustration or anger.  e,g. For disapproval/frustration : \"Shahmat te gonah\"         For anger: \"cxe cheya Shahmat aamecx\" means \"do u want to be beaten etc\"       Or...Kasheeri Che pethy kyataam Shahmat.", "Shahmath": "Meaning Not Available", "shahruk": "Urbanite", "Shakal": "Meaning Not Available", "Shalimar Bagh": "Meaning Not Available", "Shanghun": "To sleep", "Shankracharya": "Meaning Not Available", "Shansh": "Means Breath", "Shararath": "Meaning Not Available", "Sheen": "Means Snow", "Sheeseh": "Means both glass and mirror - depends on the context it is used. \"Ye shu sheeshuk banoymut\" (This is made of glass) - references it as glass and \"Sheeshash maenz wuch\" (Look in the mirror) references mirror", "Sheeshar Gaanth": "Icecle. Commonly seen hanging from roof edges in Srinagar after snowfall in freezing winter.", "Sheeshar Ghaanth": "Meaning Not Available", "Shehjar": "Meaning Not Available", "Shejar": "Meaning Not Available", "Shikas": "Shikas  : It translates to misery thus when your bestie asks you to pour tea from the kettle and you accidentally pour it on table instead of the cup, that's when  Shikas  can be used, but should be avoided when with parents.  Also a Shikas-lad translates to misery stricken which can be used to curse someone or to simply say how his or her (then it would be shikas-laddien) state of affairs are.", "Shikaslad": "It means that person who haven't anything in her home or he is out of money .  Its is used as abuse in kashmiri laungauge.", "Shirchai": "A pink tea with salt - yes you heard it right - it is pink in color and salty and deeelicious. Also called  Noonchai .  It is supposed to be appetizing and made with sodium bicarbonate which gives it the pink color", "Shireen": "What is it called in english?                    It is a white and sweet sugary snack - used for ceremonial purposes and thrown on the groom when they come as part of the baraat", "Shoar": "Another hindi word copy - means noise or noisy", "Shonth": "A ground powder used as a spice - most likely ground ginger powder", "Shoob": "Meaning Not Available", "Shoobe scit kher": "Having problem with everything,basically one who is problematic.", "shoosh": "Meaning Not Available", "Shoosh myon": "Meaning Not Available", "Shrooch": "This word probably has a more complicated meaning but its simplified meaning is clean or sanitary. The cleanliness had a religious context and still does. On religious occasions things that are  Shrooch  are all that can be eaten by Kashmiri pandits", "Shuhh": "Swelling that hurts on your feet if you did not wear socks in the winter and walked a lot on cold floors - not sure what it is called in English", "Shur": "Means Child, not to be confused with  Shor", "Sichan": "Needle or Pin - not sure if there was a difference", "soan meeraas": "We are Click Thru Networks (CTN). We are one of the leading advertising and Mobile networks in India.   We deal with online Web, WAP, E-mailer & SMS campaigns on various formats like CPM,CPC,CPI,CPD,CPS,CPL, Cost per Mailer, CPA.  If you have any requirement please contact.", "Sonth": "Spring - not to be confused with the spice  Shonth", "SONZAL": "Meaning Not Available", "Soonth": "The season Spring", "Soor": "Meaning Not Available", "Soyeth": "Means a Wick", "SP College": "Sri Pratap College right in the heart of Srinagar - named after Maharaja Pratap Singh.  Established in 1905 by Annie Besant for the then ruler of Jammu and Kashmir Shri Maharaja Pratap Singh. Before Indian independence, the college was affiliated with University of Lahore and post independence Banaras hindu university gave affiliation to SP college till University of Kashmir was founded in 1956 (Wikipedia)", "Sranth": "Death means swimming", "Srinagar": "The main and major city in Kashmir - the summer capital of the state.  Srinagar has a long history, dating back at least to the 3rd century BC, and has been known by different names. The city is said to have been founded by the King Pravarasena II over 2,000 years ago.   Srinagar became the capital of Kashmir around 960 CE (Wikipedia)", "Syun": "General term for cooked vegetables or anything you eat with rice, even meat", "Syun kyah chuv az": "Batni  would ask this from her neighbours to find out (rather pry) \"what did they cook for their meals today\"", "Taaph": "Sunny                    Sunny                    Sunny                    Sunny", "Taas": "Cracker. One u burst on Diwali. Taas also means to hit some one. Maybe due to the noise it makes. T", "Tabakmaaz": "A typical kashmiri mutton cuisine prepaired by frying mutton in ghee.", "Taenth": "Meaning Not Available", "Tafreekh tultam": "You are bothering me", "Tai wai": "Meaning Not Available", "Tamasheh": "It has two meanings - A Show or A Toy", "Tamater": "Probably from the hindi word equivalent - means Tomato", "Tamblaan": "To get excited quickly. Tamblun is the act of getting excited", "Tamul": "It means uncooked Rice. Cooked rice is called Batta", "Tapael": "It was blessing from elder pandits to there children they used to scold them with it ...tap means meditations and ael means in abundance                      It was blessing from elder pandits to there children they used to scold they with it ...tap means meafitation n ael means in abundance                      Never knew what this word meant - anyone knows?", "Taraf": "Side (direction)  Kyemi  Tarafeh", "Tarakh": "My kashmir is very beautiful", "Tarangah": "Tradional Headdress worn by Kashmiri Batnis", "Tavan": "Meaning Not Available", "Tavanzad": "Meaning Not Available", "Tavanzud": "Meaning Not Available", "Tche": "Tche is a simply used for 'you", "Teel": "Means oil (cooking or petrol)", "Teer": "Teer means cold", "Telvur": "Like a Bagel - sesame seed covered bread usually eaten with the afternoon  Shirchair", "Tez": "Means Fast - probably from Hindi/Urdu roots", "Thaal": "traditional kashmiri plate", "Thandeh": "When something is cold - Thandeh Tresh - Cold Water", "Thapyare": "To slap", "Thathri": "Thathri is a town in Doda district of Chenab Valley in Jammu and Kashmir. Thathri town can be searched on Google Maps by the name \"New Thathri\".", "The Chenab Times": "The Chenab Times is a social media based website which promotes Chenab Valley (including Kishtwar, Doda and Ramban districts) via Instagram, Facebook, YouTube and Twitter also.", "Thod": "Means Tall", "Thodh": "Means Tall or in case of Thodh Wathun means Up, so it may really mean up.", "Tikeul": "Tikeul is a thick and short mace usually wooden fastened into the soil used to tie an animal to.", "et byol": "Meaning Not Available", "Toet Byol": "Cotton Seed", "Toet yinder": "A wooden tool used to separate cotton seeds from cotton. Cotton used to be grown in Kashmir many years back", "Tooker": "A wicker basket used to store many things - it was made in various shapes and some had handles too.  Some of them were decorated and well made and sold to tourists as Kashmiri Handicrafts", "Tor": "This used to be a wodden latch that was used to secure doors - not a lock but to just keep them shut. Very prevelant in old houses of  Habbakadal   Fatehkadal   Zainakadal  etc", "Tos ha ba tultam": "Means you are bothering me a lot", "Toth": "Meaning Not Available", "Totmah": "A fad - a toy -  a fancy, shiny object", "Trakur": "It also means hard like  Doar  but more like crunchy or crisp.  Trakur   Telvur  kyah ba anuth", "tral": "beautiful town in south kashnir", "Tratakuti": "A mountain - also a house in Biscoe school spelled Tatakotti", "Trath": "Peyey kalas trath dalað\u009f\u0098\u0082                    trath is word used in kashmir for cloud brust.                    \"Dopmaie Treth Hish Chaekh Lagae\" me to my sharikhae heyat  \"Trath emin kosher muslman hahran.. dale bachae\" I think you got it                    Cloud burst. In Kashmiri language \" trath\" can be exchangeably used for words great, beautiful, commandable. As curse against foes. Both positive n negative word. Tratilad (person on whom trath/cloud burst should fall) can be used for a person like a wolf in sheep clothing                    Good shot by anyone on Google hatsoff to you man                      Kanni chetti trath yem asi musiabates laggi.                    A in bad way it could also mean Pakistanis tu musalamanan trath                    Mazz balai te noen zahar....                    Trath payi ath...                    trath pey modi nes khanas                    Trath meaning in English \"Lightining\". An example of trath say suppose somebody is saying to his friend\"Khanas chanis trath\" which means \"may Lightining on your home\" which someday says in anger to any other person.                    Payey trath kalas                    Trath is cloud burst  Wezmal is lightning and gagarai is thundering.     Kam balai chiv                    'Trath is a kashmiri word which .means cloudburst                     We donâ\u0080\u0099t have to be â\u0080\u009ckeekâ\u0080\u009d here for once. Just take the humor and enjoy. Not everything needs to be corrected.                     Kajelkhari te bai kya                      Seriously kashmiri's r trathâ\u009d¤                      Yi chu kaeshur kalla                     Tratth hish kuur  www.koshurwear.com                     I think it's better spelled as tratth to emphasize the 'tth' sound like in 'tthandi' /cold                    HAhaâ\u0098ºï¸\u008freally.... kashmiri rocks   India shocks..........  Tera bharat mahan 100 mein sy 100 beimaan..phir sy kashmir rocks bharat shocks....trathâ\u0098ºï¸\u008fð\u009f\u0098¢                      \"kashmirpedia\"  its very nice but can I app of this site                     individual project or company running this website???                     Trath is a Kashmiri word that means cloud burst.It is a unique word on everyoneâ\u0080\u0099s tongue to give compliment or abuse anyone. In case when trath is used as compliment the attitude of the person for which it is used gets on top level generally used for girls e.g trath hish chak gamech etc means you are looking gorgeous and as an abuse it is generally used for India 1000 times eg. Trath pei hindustans, trath waskhe yeman hinden hahaha means India should be destroyed by cloud burst.                    Trath is basically a cloudburst. Thunder is gagrai and lightening is wuzmal.     Trath is not thunder and lightening.                    Pewywo trathey goley....                     Trath means lightning. E.g Trath Hindustanas means may lightning strike India. Most popular of word Trath in Kashmir                     Trath typically means \"lightning\" and is used as a compliment or an abuse based on the way ome frames their sentence. As a compliment, \"trath hish\" is like saying \"amazing/gorgeous, etc\". As an abuse word: eg. \"Hindustanas trath\" means \"may lightening strike India/ may India be destroyed by lightning\"                    It is also used as a failure word \"tey kyaa Trath\".                    As the word is now used as like \"WTF\" the generation says now \"what the trath\".                    Some times its also used to complement.....shakal chhay trath hish....or trath hish chhak gaemech azz                    Means Thunder - used as an abuse - Trath Paeyey", "Travun": "Means To Leave - sentence can be Travu Katha", "Tre": "Means the number 3", "Tresh": "Used in two ways meaning Water and Thirst - Tresh layj -  (I am thirsty) and Tresh dita (get me some water). Used primarily by Hindus.  Muslims refer to water as  Aab", "Tsaai": "Shadow", "Tulmul": "Also known as Khirbhawani - a very revered religious site for Hindus", "Turun": "Anything cold", "Vaatun": "Meaning Not Available", "Vadun": "To cry", "Vadvun": "Someone who cries - a cry baby", "Vaguv": "Straw mat . Commonly used under a carpet.  Hand made.", "Vakh": "A form of poetry commonly used by Lal  Ded  - referred to as Laleh Vakh - the Vakh of Lal Ded", "Valun": "Meaning Not Available", "Vandur": "Seems like the word may be a cross between Vanar and Bandar                    Interesting word                    Vandur is the kashmiri equivalent of a Monkey", "vangun": "Meaning Not Available", "vanvun": "Meaning Not Available", "Vapas": "Direct Hindi word - means return", "Var": "To be upset or angry", "Varimuth": "They are small black beans", "Variyah": "Means Many - Variyah variye kyah se gayi- means many years have gone by", "Varmul": "Meaning Not Available", "Vartaavun": "Meaning Not Available", "Vath": "The way in simple terms.Used in many other ways like  Vath haveny : to guide or coach  Vath raavmech' : wayward", "Vatul": "Sweeper or Cleaner", "Vedaakh": "Narrating good deeds of a dead person in course of weeping", "Veer": "Willow tree", "virin": "Meaning Not Available", "VISHNASAR": "Meaning Not Available", "VISHNUPAD": "Meaning Not Available", "Voharwod": "Means Birthday", "Voonth": "Camel", "Vopal Hakh": "Another type of  Hakh", "Vosteh Hakh": "A type of  Hakh", "vozul": "Vozul is the name for color red", "Vuchun": "Burnt milk", "Vuzbal": "Meaning Not Available", "Vuzmal": "Lightning usually followed by  Gagarai", "Vy": "A root used in the  Sonth   Thaal  for Thaal Barun", "Vyachar Naag": "Meaning Not Available", "Vyekhuth": "Meaning Not Available", "Vyeth": "Other name for River  Jhelum  or  Vitasta", "Vyethravun": "Meaning Not Available", "Vyugh": "A decorative rangoli like formation made during marriages for the bride and bridegroom to step on while leaving or entering a house", "Waath": "Cooked  corn                    Binding", "Waatul": "Means a cleaner - someone who used to sweep streets and before flushable toilets became prevalent, they used to take out human waste from the outdoor latrines in the cities", "Waavigh": "A hand held fan - made of soft wicker", "wadun": "weeping", "wadwun": "One who weeps", "Waguv": "A mat usually of dry grass", "Waii": "Waii is a numb and tickling feeling  in any of the body parts such as legs ,arms , hands.", "Wakheth": "Time - like in Wakheth kyah baa aav? (What time is it?)", "Wakhul": "Wakhul is the Kashmiri term for stone mortar and pestle :)                    Kitchen appliance made of stone used to grind. You need a kajwath for grinding in it.", "Walinjye dyeedes rohanhi chyot": "Meaning Not Available", "Wandeh": "Winter - the season when  Sheen  would be on the ground", "Wangun": "Also known as Egg plant or Aubergine.   I also made an awesome  Tamater  Wangun  with this when I am the  Waza  at a  Saal                     Brinjal. Perhaps the most consumed of all foods after Mutton. Best variety chuk (sour) wangun.", "Wanun": "Is to \"Speak\" - not to be confused with  Wanwun", "Wanwun": "wanwun is the traditional kashmiri songs sung by kashmiri ladies on weddings. It is considered as very auspicious for the bride and bridegroom. It is known that the lyrics are the blessings given to the bride and groom.                    Wanwun is traditional Kashmiri music and is generally sung at weddings.                    Sounds like a new Mall !  Arnimal was a famous poet from what I remember and probably from the Kachru family in Srinagar                    i WOULD LIKE TO KNOWN ABOUT ERNIMALL", "Waray": "Usage - Waray Chukh Ba (asking a male if they are ok), or Waray Chakh Bi (asking a female if they are ok)", "Waray chakh bi waray": "Meaning Not Available", "Waray chuk": "One of the most common sentences Kashmiris teach their non-kashmiri friends.  Most get the Waray part right but the Chuk or Chukh has many variations based on where you are from.", "Wareh Wareh Pakh": "Walk slowly", "Wariyah": "Means many or much as in Wariyah kaal gav (Much time has passed) OR Wariyah  lookh  aeys aamit (Many people had come)", "Wasta": "MASTER, mostly used for Driver, Mason, Carpenter, etc", "Wasun": "Yes i have misspelled the word. Later sent a report for correction,not acted on yet. Thanks.                     Sonal you may be referring to  Wanun  as Tell me - rather used as  Wan  - Talla Wan - Please tell (me).    Wasun  means to come down - Hyeri pyateh wasun - means to come down from upstairs                    Tell me", "Wazul": "wazul means red                       Wozgyar  is related                    Color Red", "wazwan": "Traditional Kashmiri cuisine.  Consists of Gushtab, Rista, Rogan Josh, Tabak Maaz etc.", "Wohwoh": "A bad or curse word or words", "Wohwun": "Cursing, To curse", "Woin": "Water", "Wokhe": "Wokhe means Dangerous", "Wokhul": "A big or small vessel made of stone used to grind all kinds of things in - English equivalent - mortar and pestle?", "Wonh": "To say - Mye Wohn tamis - I told him (or her) - it is gender neutral", "Woonth": "Or a last name for some Kashmiris                    Means Camel", "Woonun": "The act of knitting (a sweater usually)", "Wozgyar": "Redness", "Wuth": "Means Lip", "Wyoth": "Opposite of  Nyuk  - means Thick or Fat", "Yaad": "Meaning Not Available", "Yakhni": "The most amazing dish ever invented by Kashmiris...â\u0099¥ï¸\u008f                    A yogurt based lamb dish", "Yalath": "Meaning Not Available", "Yamberzal": "Daffodil - a common sight in spring  Soonth", "Yandir": "Meaning Not Available", "yari changur": "Meaning Not Available", "YEMSAR": "Meaning Not Available", "Yerevan Naav Cheervun Dhol": "Most commonly used phrase to describe an avoidable problem. Yerevan Naav is a boat set loose as one forgot to tie it. Cheervon dhol when you jump into water to stop the boat and in the process get the your clothes drenched.", "Yinder": "Spinning wheel, Charkha", "Yirven Naav Gachin": "Meaning Not Available", "Yurvinnaav": "Meaning Not Available", "Zaal": "It has two meanings, both pronounced the same way:  1. Cage or Trap similar to word Jaal from Hindi  2. Cold sore - one you get around your lips in the cold", "Zaam": "Sister in law", "Zaamtur": "Means son in law", "Zaamut doud": "Curd milk", "Zaan": "Means Familiarity or Recognition. Zaanaan or Zaanun", "Zaar": "Gamble", "Zahar": "Zahar: literally mean poison. But is used as slang to appreciate (boi chui zahar)", "Zainakadal": "It is a bridge and the surrounding area in old Srinagar city. One of the famous bridges over Jhelum river", "Zaindar Mohalla": "Meaning Not Available", "zal gur": "Meaning Not Available", "Zalgur": "Meaning Not Available", "Zalun": "This means intentional burning", "Zamud dod": "Yoghurt or curd made eg zamud dod che means drink curd", "Zananeh": "Used both for woman or wife - based on the context", "Zang": "Also means Rust                    Means  Leg", "Ze": "The number 2", "Zeethyaer": "Meaning Not Available", "Zero Bridge": "A 60 year old bridge over the Jhelum dismantled in 2012. According to NDTV  \"The bridge was constructed by a local contractor who was deaf. 'Zorr' means deaf in Kashmiri and the bridge was initially known as the 'Zorr Bridge' which later changed to Zero Bridge,\" said an elder living across the Jhelum River in Rajbagh residential area.", "zev": "zev means tongue", "Zilh Dyun": "To scratch someone - Zilh is scratch", "Zitin": "Ã§hingari or spark of fire", "Zoak": "Meaning Not Available", "zok": "it is a hair near your liyath or goodh", "zong": "zong is the kahmiri word for fire", "Zoo wanday": "Meaning Not Available", "Zoon": "Means Moon", "Zoung": "Zoung means fire", "Zounkotuk": "It means wear brand clothes and live like king", "Zovazaet": "Meaning Not Available", "Zow": "Lice, like eww bihari has so many lice in his head", "Zuk": "Zuk is name of a private part of Human body which means Public hair. Only found  around dick and upper part of Pussy.                    Means pubis hair", "Zukaam": "Cold, runny nose.", "Zuu": "Meaning Not Available", "zuv": "Means Life used in the common term - Zuv  Vandun", "zuv vondmay": "I bestow my life over you.                    \"Myon marun chui\" - nice name !!", "Zyanun": "Means To Win - opposite of  Haarun", "Zyate": "Means shining ...  Like we use 'zyate heu', which means very beautiful", "Zyenun": "To win", "Zyuth": "It is probably an elongated uuu zyuuuth. The short u actually means an elder person                    Means Long"}